[{"id":"16","title":"R&D Engine Design","role":"Senior Design Engineer","job_location":"Hoshiarpur","company":"International Tractors Limited","eligibility":"B.Tech\/B.E.","experience":"3 years","website":"www.sonalika.com","walkin_date":"","walkin_time":"","walkin_address":"","company_profile":"Established in 1969, Sonalika group since the inception has tried to understand customer need to be facilitating them with its value for money products. The Company has a state of art manufacturing facilities, spread in acres, located in the free shrubs of Punjab and Himachal Pradesh.","job_description":"- Nx 3d Modeling & 2D drafting in Nx4\n\n- Design parts of Engine \/ Engine Calculation.\n\n- Knowledge of engine system, Engine combustion development\n\n\n- We are looking for UG \/ NX Engine Design Enginer.\n\n- Min 3 years Experience\n\n- Location : Hoshiarpur (Only)","apply_link":"","contact_no":"","email_id":"careers@sonalika.com","logo":"https:\/\/www.sonalika.com\/assets\/img\/sonalika-logo.jpg","entry_date":"2020-08-24"},{"id":"15","title":"JUNIOR EXECUTIVE MARKETING","role":"JUNIOR EXECUTIVE MARKETING","job_location":"Mysore","company":"Shahi Exports Pvt Ltd. ","eligibility":"B.Tech (Textile) or Diploma in Apparel or BSc and MSc in Fashion","experience":"1-3 years","website":"www.shahi.co.in","walkin_date":"","walkin_time":"","walkin_address":"","company_profile":"We are the number one garment exporter from India in terms of sales with a turnover close to 5500 crores. Having about 40 fully integrated garment manufacturing units spread in Delhi NCR, Bangalore, Shimoga, Hyderabad and Tirupur and employing close to 1,00,000 persons.","job_description":"- Should have 1-3 years of experience\n\n- B.Tech (Textile) or Diploma in Apparel or BSc and MSc in Fashion and Apparel manufacturing.\n\n- Responsible for follow up with the sampling dept.\n\n- Responsible to get approvals for threads and trims from Buyers or Buying office.\n\n- Follow up the daily plan and differences are anticipated and stand by the plan is made.\n\n- Responsible to prepare BOM.\n\n- Preparing TNA Charts.\n\n- Responsible for order booking and execution.\n\n- After receiving PO’s from Buyers according to the quantity has to place an order for fabric and trims.\n\n- Co-ordinate with various dept like production, for improvement in production.\n\n- Handling proto sample if new styles is there.\n\n- Responsible to give shipment booking to documents departments before 10 days of expected date of delivery.\n\n- Understand the requirements on systems, orders, production, product, quality, packing, delivery and ultimately satisfaction of buyers.\n\n- Interested candidates can share CV to yashika.uthappa@shahi.co.in","apply_link":"","contact_no":"","email_id":"yashika.uthappa@shahi.co.in","logo":"https:\/\/media-exp1.licdn.com\/dms\/image\/C4D0BAQG24rKV1pl5Nw\/company-logo_200_200\/0?e=2159024400&v=beta&t=8iwcPWKqDmSIQnx9WsfwYzYjp5z1syoBGk8y5kPvpu0","entry_date":"2020-08-24"},{"id":"14","title":"Hr operations","role":" Hr operation","job_location":"Hyderabad","company":"Russell Tobin Associates Staffing Solutions India ","eligibility":"Any Bachelor's Degree","experience":"4 months -2 Years","website":"www.russelltobin.com","walkin_date":"","walkin_time":"","walkin_address":"","company_profile":"The vision of the Centralized Timekeeping team is to utilize top talent to streamline time and attendance data entry, reduce payroll defects and provide consistently high service levels. Today, CTK supports and manages time and attendance matters for thousands of Company Associates.","job_description":"Due to Covid , It will be work from home for few months . Candidate need to have laptop\/desktop with internet facility at home \n\n- Join Company's HR team and help make a difference for all Companyians! We are recruiting for a Time and Attendance Operational Admin.\n\n- The Timekeeper role is a centralized function that will manage time and attendance matters for buildings across the network.\n\n- This role requires fast, accurate, and reliable data entry.\n\n- You will work on a trouble ticket queue of time and attendance issues submitted by buildings or auto-generated from the Time and Attendance System.\n\n- Your primary focus will be resolution of incoming time and attendance inquires with opportunities for other engagement upon completion of centralized responsibilities.\n\n- You may participate in continuous improvement process projects.\n\n- A keen understanding of Company's attendance policies, employee groups, and applicable state and federal laws will be necessary.\n\n- Timekeepers will focus primarily on ticketing.\n\n- You will report directly to the Time and Attendance Manager or Time and Attendance POC.\n\nBasic qualifications:\n- 4 months -2years of data entry experience\/time keeping with minimum 1 years of relevant experience\n\n- Superior attention to detail\n\n- Knows how to escalate\n\n- Comfortable and able to provide feedback regarding the role and work volume\n\n- Aptitude for working independently with excellent problem solving skills\n\n- Strong Ownership, Bias for Action, Deliver Results, Insist on the Highest Standards\n\n- MS Office experience required - Proven experience working with Windows, Word, Excel, and PowerPoint","apply_link":"http:\/\/careers.pridetech.in\/submit-profile\/","contact_no":"","email_id":"","logo":"https:\/\/www.russelltobin.com\/app\/uploads\/2016\/07\/RTA-web-logo.png","entry_date":"2020-08-20"},{"id":"13","title":"HR Assistant","role":"HR Assistant","job_location":"Hyderabad","company":"Russell Tobin Associates Staffing Solutions India ","eligibility":"Any Graduate","experience":"1+ Yrs","website":"www.russelltobin.com","walkin_date":"","walkin_time":"","walkin_address":"","company_profile":"Russell Tobin is a minority-owned professional recruitment and staffing advisory firm assisting clients with direct hire and contract talent search solutions across a variety of skillsets and industries.","job_description":"- We are looking for the candidates having 1+ Yrs of experience in Exit Formalities\/HR Operations\n\n- Notice Period : Immediate Joiners only\n\n- Location : Hyderabad","apply_link":"","contact_no":"9384052855","email_id":"lakshmi.gs@russelltobin.com","logo":"https:\/\/www.russelltobin.com\/app\/uploads\/2016\/07\/RTA-web-logo.png","entry_date":"2020-08-20"},{"id":"12","title":"Back Office Associate","role":"Associate\/Senior Associate","job_location":"Pune","company":"AtosSyntel","eligibility":"Any Graduate","experience":"0 years","website":"www.atos-syntel.net","walkin_date":"","walkin_time":"","walkin_address":"Unit No. 112 SDF IV Seepz, Andheri (E), , Andheri (E), MUMBAI, Maharashtra, India","company_profile":"Atos|Syntel is a leading global provider of integrated information technology and knowledge process services. Atos|Syntel helps global enterprises evolve the core by leveraging automation, scaled agile and cloud platforms to build efficient application development and management, testing and infrastructure solutions.","job_description":"- Excellent Communication Skills.\n\n- Readiness to work in Night Shifts\n\n- Comfortable to work in Healthcare back office process\n\n- Should have Good analytical & data interpretation skills.\n\n- Should have a good knowledge of Insurance and US healthcare process.\n\n- Should have good knowledge of claims, corrected claims and claims process.\n\n- We are looking for candidates only from Pune location currently\n\n- Compensation:: 1.95 LPA\n\n- Candidates pursuing ICWA, CS, CA, B.E. and B.Tech graduates are NOT eligible to apply for the same.\n\n- Candidates who have applied and interviewed in the last 3 months need not apply.\n\n- Candidate pursuing their UG and PG, not Eligible\n\n- Interested candidates please apply on the posting or share your updated resume to nikita.vaidya@atos.net or ekta.chorasiya@atos.net","apply_link":"","contact_no":"","email_id":"nikita.vaidya@atos.net or ekta.chorasiya@atos.net","logo":"https:\/\/www.atos-syntel.net\/sites\/all\/themes\/syntel\/as-logo.png","entry_date":"2020-08-20"},{"id":"11","title":"CORE JAVA DEVELOPER","role":"Software Developer","job_location":"Bengaluru","company":"Wissen Technology","eligibility":"","experience":"3 to 8 years","website":"www.wissen.com","walkin_date":"","walkin_time":"","walkin_address":"PSR Towers, 2nd Floor, # 6 Gulmohar Enclave,, Airport white Field Road, Marthahalli, BANGALORE, Karnataka, India","company_profile":"Wissen Technology is a specialized technology practice for high end consulting primarily geared towards the domains of Banking & Finance, Telecom, and Healthcare. We believe that the technology and thought leadership that we command in the industry is the direct result of the kind of people we have been able to attract, to form this organization.","job_description":"- Application design and development using Java\/JEE with various design patterns and open source technologies like Spring, Hibernate and Struts.\n\n- End to end ownership of the products you work on including but not limited to design, development, testing and delivery.\n\n- Conforming to industry standards for application development and managing teams.\n\n- Continuously Client, evaluate, and implement new technologies to maximize efficiency and performance.\n\n- Experience with open source frameworks such as Spring, Hibernate, Struts.\n\n- Extensive experience in Java\/JEE, JSF, Servlets, JSP and JDBC.\n\n- A great attitude and the willingness and desire to learn and grow.\n\n- Ability to pick up new concepts rapidly and a talent for technology.\n\n- A strong sense of commitment to achieving results.\n\n- Must to have: Core Java, multi-threading, collections, data structures, springs, design patterns","apply_link":"https:\/\/www.wissen.com\/careers-2-2\/career-opportunities-wissentechnology\/?p=job%2Fo2iqcfwG","contact_no":"","email_id":"yogprasad.soni@wissen.com","logo":"https:\/\/www.wissen.com\/wp-content\/uploads\/2019\/03\/Wissen-Logo-Final-1-02.jpg","entry_date":"2020-08-19"},{"id":"10","title":"Process Associate – GEP Solutions: (night Shift)","role":"Process Associate","job_location":"Navi Mumbai","company":"GeP Solutions Pvt. Ltd.","eligibility":"B.B.A \/ B.M.S | B.Com | BFA | B.Sc","experience":"0 to 2 year","website":"www.gep.com","walkin_date":"","walkin_time":"","walkin_address":"13th Floor, Building No. 3,\nGigaplex, Airoli Knowledge Park,\nAiroli (W), Navi Mumbai – 400708","company_profile":"GEP helps global enterprises operate more efficiently and effectively, gain competitive advantage, boost profitability, and maximize business and shareholder value. Fresh thinking, innovative products, unrivaled domain and subject expertise, and smart, passionate people ¢‚\" this is how GEP creates and delivers unified business solutions of unprecedented scale, power and effectiveness.","job_description":"- Review purchase requisitions and create POs in line with the standard operating procedures\n\n- Update the Vendor Master Records\/Updates\/New Vendor Setup in system.\n\n- Follow up with vendors via email\/phone to get Purchase Order Acknowledgements.\n\n- Follow up with vendors via email\/phone to ensure goods are delivered on-time.\n\n- Co-ordinate with client sites and vendors for purchase order related issue resolution .\n\n- Strong communication skills & written skills\n\n- Knowledge of purchasing processes (PF)\n\n- Knowledge of MS-Office suite (PF)\n\n- Team player, high motivation, positive, can-do attitude, flexibility\n\n- GRADUATION PASSING YEAR can either be 2018, or 2019 \n\n- AGE CRITERIA:- 21 Years to 25 Years","apply_link":"https:\/\/jobsindia-apac-gep.icims.com\/jobs\/intro?hashed=-626005004&mobile=false&width=1349&height=500&bga=true&needsRedirect=false&jan1offset=330&jun1offset=330","contact_no":"+91-22-6137-2100","email_id":"careers@gep.com","logo":"https:\/\/www4.gep.com\/sites\/all\/themes\/gep\/images\/logo.svg","entry_date":"2020-08-17"},{"id":"9","title":"PeopleSoft Administrator","role":"PeopleSoft Administrator","job_location":"Bengaluru","company":"Cibersites India Private Limited","eligibility":"","experience":"2 to 6 yrs","website":"www.ciber.com","walkin_date":"","walkin_time":"","walkin_address":"6th & 7th Floor, Tower 3,Aquamarine, BANGALORE, Karnataka, India","company_profile":"Ciber is an IT consulting company who partners with organizations to develop technology strategies and solutions that deliver tangible business value. Founded in 1974, Ciber is part of the 11000+ people strong HTC Global group that has a presence across US, Europe, Middle East and Asia Pacific. As a preferred IT partner Ciber has nurtured customer relationships that span decades.","job_description":"- Strong Peoplesoft Applications Upgrade and PeopleTools Upgrade experience\n\n- Peoplesoft PUM Images installation, setup and apply updates\/bug fixes and PRP’s.\n\n- Peoplesoft oracle CPU Patches and updates apply .\n\n- Oracle DBA knowledge is preferable\n\n- Experience of applying PeopleSoft updates such as Tax-Updates, Bundles & Maintenance Packs.\n\n- Experience of PeopleSoft application migrations from one type of Database to other\n\n- Strong PeopleSoft Administration Skills with Oracle Database.\n\n- Should have worked as a PeopleSoft DBA across customer projects on Production Support as well as Implementation projects\n\n- Experience in tuning PeopleSoft servers (app server\/webserver\/process scheduler tiers) to maximum performance.\n\n- Provide best practices for PeopleSoft Server for Optimum performance of application and related processes.\n\n- Demonstrated ability to work with application developers to resolve issues.\n\n- Performance Monitoring and Tuning\n\n- Database Refresh\/cloning\n\n- Performance Tuning of the PeopleSoft Process\n\n- Experience in PeopleSoft Application and Non - PeopleSoft applications Integration Broker configuration.","apply_link":"https:\/\/jobs.ciber.com\/#\/home","contact_no":"080669 90500","email_id":"","logo":"https:\/\/www.ciber.com\/wp-content\/uploads\/2017\/07\/Ciber-Logo.svg","entry_date":"2020-08-17"},{"id":"8","title":"Healthcare Process (Backoffice), Pune","role":"Associate\/Senior Associate","job_location":"Pune","company":"Atos Syntel Private Limited","eligibility":"Any Graduate","experience":"Fresher","website":"www.atos-syntel.net","walkin_date":"","walkin_time":"","walkin_address":"Block S5, Plot no B-1, MIDC Software Technology Park, Talawade. Pune-411062. India","company_profile":"Atos Syntel is a leading global provider of integrated information technology and knowledge process services. Atos Syntel helps global enterprises evolve the core by leveraging automation, scaled agile and cloud platforms to build efficient application development and management, testing and infrastructure solutions. Our digital services enable companies to engage customers, discover new insights through analytics, and create a more connected enterprise through the internet of things.","job_description":"- Excellent Communication Skills.\n\n- Flexibility to work in Night Shifts\n\n- Comfortable to work in Healthcare back office process\n\n- Should have Good analytical & data interpretation skills.\n\n- Candidates pursuing ICWA, CS, CA, B.E. and B.Tech graduates are NOT eligible to apply for the same.\n\n- Candidates who have applied and interviewed in the last 3 months need not apply.\n\n- Candidate pursuing their UG and PG, not Eligible\n\nInterested candidates please apply on the posting or share your updated resume to nikita.vaidya@atos.net or ekta.chorasiya@atos.net","apply_link":"","contact_no":"","email_id":"nikita.vaidya@atos.net","logo":"https:\/\/www.atos-syntel.net\/sites\/all\/themes\/syntel\/as-logo.png","entry_date":"2020-08-17"},{"id":"7","title":"Team Leader- Work Force Management","role":"WFM – Team Leader","job_location":"Pune","company":"Tech Mahindra Business Services","eligibility":"Graduation","experience":"Min. 4 Years","website":"www.techmbs.in","walkin_date":"","walkin_time":"","walkin_address":"","company_profile":"Tech Mahindra Business Services is a subsidiary of Tech Mahindra which is a part of the Mahindra Group. Tech Mahindra is a USD 4.9 billion company with 131,500+ professionals across 90 countries, helping 946 global customers including Fortune 500 companies. ","job_description":"Team Leader – WFM will be responsible for managing all activities associated with scheduling & real-time management effectively. Also to achieve the business objective & service level objectives by maximizing efficiencies, occupancy & utilization.\n\nRoles and Responsibilities\n• Review Weekly forecast and provide inputs\n• Review weekly intraday & rosters\n• Review KPIs and Service Level projections for the coming week\n• Ensure Service Levels & other KPI’s are met consistently as per plan\n• Effectively manage outage scenarios\n• Outlier management for all efficiency parameters\n• People management – activities like coaching, mentoring, appraisal conversations, etc\n\nEducation\n• Minimum – Graduation\n• Strong knowledge of MS Office – additional knowledge of MS Visio & MS Access is desirable\n\nExperience\n• Minimum 4 years of work experience in Workforce Management\n• Minimum of 2 year experience as Team Leader (WFM)","apply_link":"","contact_no":"9619086213","email_id":"ishaan.vasavada@techmahindra.com","logo":"https:\/\/pbs.twimg.com\/profile_images\/378800000563066338\/313276059ef8f8830b034e143bbfb51a_400x400.jpeg","entry_date":"2020-08-13"},{"id":"6","title":"Bengali candidates For Tech M Kolkata","role":"Customer Support Associate (CSA)","job_location":"Kolkata","company":"TECH MAHINDRA LIMITED","eligibility":"Min 12th Passed","experience":"0 - 1 years","website":"www.techmahindra.com","walkin_date":"12th - 14th August","walkin_time":"11.00 AM - 4.00 PM","walkin_address":"Tech Mahindra Kolkata, DLF 2 Tower B, 4th Floor, Kolkata 700156 (Opposite Gitanjali IT Park)","company_profile":"Tech Mahindra Limited is an Indian multinational technology company, providing information technology and business process outsourcing services. A subsidiary of the Mahindra Group, the company is headquartered in Pune and has its registered office in Mumbai.","job_description":"- Min HS Passed.\n- Fresher & Experience both can apply\n- Able to read and comprehend from English to Oriya\n- Customer orientation.\n- Ready to work in 24\/7 Shifts\n- No planned leave for upcoming 3 month after joining\n- 9 hour of the day, 8 hrs. work and 1 hour break\n- Should have a typing speed of 18WPM with 80% accuracy\n\nInterview Structure\n- HR round - General check. -Telephonic\n- OPS & Training round – Communication and Other fitment Check – Telephonic\n\nDocuments Required –\n- Education Mark sheet\n- Aadhar Card\n- Pan Card\n- Offer Letter, Last 3 Salary Slip, Bank Statement, Experience Letter (Only for experience candidates)","apply_link":"","contact_no":"","email_id":"","logo":"https:\/\/easyconvertertools.com\/android\/images\/tech_mahindra.png","entry_date":"2020-08-13"},{"id":"5","title":"HIRING FOR INTERNATIONAL VOICE PROCESS","role":"Associate\/Senior Associate","job_location":"PUNE","company":"Mphasis Limited","eligibility":"Graduates Freshers ( Except BE , B.Tech or MCA )","experience":"0 to 2 year(s)","website":"www.mphasis.com","walkin_date":"","walkin_time":"","walkin_address":"","company_profile":"Mphasis is a leading IT solutions provider, offering Applications, Business Process Outsourcing (BPO) and Infrastructure services globally through a combination of technology knowhow, domain and process expertise.\n\nMphasis Limited (then, Mphasis BFL Limited) was formed in June 2000 after the merger of the US-based IT consulting company Mphasis Corporation (founded in 1998) and the Indian IT services company BFL Software Limited (founded in 1993).","job_description":"- Graduates Fresher Any Discipline ( Except BE , B.Tech or MCA ) \/ (10 + 2 + 3)\n\n- Experience in International voice process can also apply.\n\n- Good communication skills\n\n- Open to work in evening shift\n\n- Fixed Shift\n\nBenefits\n- Fixed Saturday and Sunday Off\n\n- Pick up and drop facility\n\n- Global standard work environment\n\n- Performance linked incentives","apply_link":"","contact_no":"","email_id":"mail your resume on Anshu.pandita@mphasis.com","logo":"https:\/\/www.mphasis.com\/content\/dam\/mphasis-com\/global\/logo\/mphasis-logo.png","entry_date":"2020-08-08"},{"id":"1","title":"Siemens hiring for Software Engineer - C","role":"Software Engineer - C","job_location":"Pune","company":"Siemens","eligibility":"Bachelor's Degree","experience":"2 - 6 Years","website":"www.siemens.com","walkin_date":"","walkin_time":"","walkin_address":"","company_profile":"The activities of our Energy, Healthcare, Industry and Infrastructure & Cities Sectors have enabled us to capture leading market and technology positions worldwide. Technological excellence, innovation, quality, reliability and international focus have been our hallmarks for 165 years, making us strong and linking us to our shareholders, employees and customers as a partner of trust. We’re one of the world’s largest providers of green technologies. Products and solutions from our Environmental Portfolio already account for some 42% of our total revenue. In fiscal 2012, our roughly 370,000 employees generated revenue from continuing operations of about €78 billion and income from continuing operations of €5.2 billion.","job_description":"Design, build, and maintain efficient, reusable, and reliable C programming.\nEnsure the best possible performance, quality, and responsiveness of applications.\nWork towards defect prevention and provide proposals to team and leads for the same.\nBachelor’s degree in Electronic and Tele-Communication OR Computer Science.\n2 – 6 years of experience in C Programming.\nHands-on experience with Linux.\nGood Knowledge OS concepts.\nMust be Aware of testing (module test and integration test).\nKnowledge of VXWORKS.","apply_link":"https:\/\/jobs.siemens.com\/jobs\/203076","contact_no":"","email_id":"","logo":"http:\/\/www.todaywalkins.com\/Comp_images\/Siemens.jpg","entry_date":"2020-08-05"}]